In [9]:
%pip install pyodbc

import pyodbc
import pandas as pd

server = 'LAPTOP-USMIAD3A\SQLEXPRESS'


#Connect to existing database
# connection = pyodbc.connect(
#     'Driver={SQL Server};'
#     'Server=LAPTOP-USMIAD3A\SQLEXPRESS;'
#     'Database=AdventureWorksDW2017;'
#     'Trusted_Connection=yes;'
# )

#Connect To Server
connection = pyodbc.connect(
    'Driver={SQL Server};'
    'Server=LAPTOP-USMIAD3A\SQLEXPRESS;'
)

print("Connected")

Requirement already satisfied: pyodbc in c:\users\jorge\anaconda3\lib\site-packages (4.0.0-unsupported)
Note: you may need to restart the kernel to use updated packages.
Connected

In [6]:
# dfEmployees = pd.read_csv(r'C:\Users\jorge\OneDrive\Escritorio\Backup OneDrive\DatasetSQLs\employees.csv').head()

# dfEmployees

,id,first_name,last_name,email,gender,related_company
0,1,Bernie,Mogford,bmogford0@ow.ly,Male,1
1,2,Mignonne,Baumler,mbaumler1@google.com.au,Female,1
2,3,Kain,Chaney,kchaney2@usda.gov,Male,1
3,4,Templeton,Woodyer,twoodyer3@amazon.co.jp,Non-binary,1
4,5,Putnem,Singleton,psingleton4@google.com.br,Male,1

In [10]:
def sql(query):
    try:
        cursor = connection.cursor()
        cursor.execute(query)
        connection.commit()
        print("Done")
    except Exception as e:
        print(f"An error occurred: {e}")

In [11]:
connection = pyodbc.connect(
    'Driver={SQL Server};'
    'Server=LAPTOP-USMIAD3A\SQLEXPRESS;'
    'Database=businessERP;'
    'Trusted_Connection=yes;'
)

print("Done")

Done

In [17]:
sql_query = 'SELECT * FROM employees'

pd.read_sql(sql_query, connection).head()

Empty DataFrame
Columns: [employee_id, first_name, last_name, email, related_company]
Index: []